
def get_order_response(json_response):
    try:
        order_name = json_response['data']['orders'][0]['status']['name']
        if order_name == "Успіх":
            return "Замовлення було доставлене та отримане. Дякуємо, що обрали ORNER! Впевнені, наші товари радуватимуть вас довгі роки. До нових зустрічей ❤️"
       
        elif order_name == "Нове замовлення":
            return "Ваше замовлення ще не оброблено. Ваше замовлення прийняте, знаходиться в обробці та готується до відправки. При потребі ми зв’яжемося для уточнення деталей ❤️."
       
        elif order_name == "Відправлено":
            return "Ваше замовлення в дорозі. Очікуйте сповіщення про прибуття ❤️."
        
        elif order_name == "Потрібен дзвінок":
            return "Ваше замовлення прийняте, проте перед відправкою нам потрібно уточнити певну інформацію. Очікуйте дзвінок менеджера найближчим часом ❤️"
       
        elif order_name == "Оплата не пройшла/очікує оплату":
            payment_link = json_response['data']['orders'][0]['payment_link']
            return f"Ви намагалися здійснити оплату, проте виникла помилка ☹️ Будь ласка, спробуйте ще раз. Сплатити замовлення можна за посиланням: {payment_link}"
        
        elif order_name == "Міжнародна відправка":
            return "Це замовлення з міжнародною доставкою і потребує додаткових уточнень. Ми зв’яжемося з вами найближчим часом тим методом, який ви обрали при оформленні замовлення ❤️"
      
        elif order_name == "Узгодження":
            return "Ваше замовлення узгоджується. Очікуйте на підтвердження."
        
        elif order_name in ["На збір", "Збирається"]:
            return "Ваше замовлення збирається і буде відправлене найближчим часом. Очікуйте SMS з ТТН ❤️"
        
        elif order_name == "Зібран":
            return "Ваше замовлення вже зібране і готується до відправки. Очікуйте SMS з ТТН ❤️"
        
        elif order_name == "У відділенні" or order_name == "У кур’єра":
            return "Ваше замовлення доставлене і знаходиться у відділенні. Запрошуємо отримати пакунок ❤️"
        
        elif order_name in ["Контроль отримання", "Контроль отримання першим дзвінок", "Контроль отримання другий дзвінок"]:
            return "Ваше замовлення доставлене і знаходиться у відділенні. Проте терміни зберігання обмежені, будь ласка, встигніть отримати свій пакунок ❤️"
       
        elif order_name == "Провал":
            return "Шкода, що ви так і не отримали своє замовлення ☹️ Дуже сподіваємось, що ви повернетеся до нас знову і все ж матимете нагоду насолодитись нашою продукцією ❤️"
       
        else:
            return f"Статус вашого замовлення: {order_name}"
    except KeyError:
        return "Помилка: Немає інформації про статус замовлення."
    
